import './Committees.scss'
import { Header } from '../../components/Header/Header'
import { useEffect, useState } from 'react';
import { useAppSelector, useAppDispatch } from '../../hooks/redux'
import { fetchCommittees } from "../../store/action/CommitteesActions";

export const CommitteesPage = () => {
 
  const [Committees,setCommittes] = useState( [
    {
        "id": 1,
        "title": "1. Աշխատանքի եւ սոցիալական հարցերի մշտական հանձնաժողով՝",
        "text": "սոցիալական ապահովություն, հաշմանդամության հիմնահարցեր, աշխատանք, զբաղվածություն, արհեստակցական միություններ, ժողովրդագրություն եւ այդ ոլորտները կարգավորող օրենքներ"
    },
    {
        "id": 2,
        "title": "2․ Առողջապահության հարցերի մշտական հանձնաժողով՝",
        "text": "առողջապահություն, մայրություն, մանկություն, դեղերի արտադրություն, ներմուծում եւ անվտանգություն, սանիտարահամաճարակային անվտանգություն եւ այդ ոլորտները կարգավորող օրենքներ"
    },
    {
        "id": 3,
        "title": "3․ Արտաքին հարաբերությունների մշտական հանձնաժողով՝",
        "text": "միջազգային հարաբերություններ, Միավորված ազգերի կազմակերպության, Եվրոպայի խորհրդի, Եվրոպայում անվտանգության եւ համագործակցության կազմակերպության, ինչպես նաեւ այլ միջազգային կազմակերպությունների հետ կապեր, միջխորհրդարանական համաձայնագրեր եւ կապեր, խորհրդարանական բարեկամական խմբեր եւ այդ ոլորտները կարգավորող օրենքներ"
    },
    {
        "id": 4,
        "title": "4․ Գիտության, կրթության, մշակույթի, սփյուռքի, երիտասարդության եւ սպորտի հարցերի մշտական հանձնաժողով՝",
        "text": "գիտություն, կրթություն, մշակույթ, հայրենադարձություն, սփյուռքի հետ կապեր, երիտասարդություն, սպորտ, տեղեկատվություն, մամուլ, ռադիո, հեռուստատեսություն եւ այդ ոլորտները կարգավորող օրենքներ"
    },
    {
        "id": 5,
        "title": "5․ Եվրոպական ինտեգրման հարցերի մշտական հանձնաժողով՝",
        "text": "Եվրոպական միության հետ կապեր, Եվրոպական միության եւ Հայաստանի Հանրապետության միջեւ Համապարփակ եւ ընդլայնված գործընկերության համաձայնագրի իրագործման հետ կապված հարցեր, Եվրոպական միության իրավական ակտերին Հայաստանի Հանրապետության օրենքների մոտարկում եւ այդ ոլորտները կարգավորող օրենքներ"
    },
    {
        "id": 6,
        "title": "6․ Մարդու իրավունքների պաշտպանության եւ հանրային հարցերի մշտական հանձնաժողով՝",
        "text": "մարդու իրավունքների պաշտպանություն, երեխայի իրավունքներ, կրոն, կանանց եւ տղամարդկանց իրավահավասարություն, ազգային փոքրամասնություններ, փաստաբանություն, հասարակական կազմակերպություններ եւ այդ ոլորտները կարգավորող օրենքներ"
    },
    {
        "id": 7,
        "title": "7․ Պաշտպանության եւ անվտանգության հարցերի մշտական հանձնաժողով՝",
        "text": "պաշտպանություն, ազգային անվտանգություն, ոստիկանություն, արտակարգ իրավիճակներ, ռազմաարդյունաբերական համալիր, զինված ուժերում, ազգային անվտանգության, ոստիկանության եւ այլ ռազմականացված մարմիններում ծառայություն եւ այդ ոլորտները կարգավորող օրենքներ"
    },
    {
        "id": 8,
        "title": "8․ Պետական-իրավական հարցերի մշտական հանձնաժողով՝",
        "text": "սահմանադրաիրավական հարցեր, հանրաքվե, կուսակցություններ, ընտրական համակարգ, Ազգային ժողովի կանոնակարգ, Սահմանադրական դատարան, արդարադատություն, դատարանակազմություն, դատախազություն, քննչական մարմիններ, դատական ակտերի հարկադիր կատարում, քրեակատարողական ծառայություն, համաներում, հանրային ծառայություն, նոտարիատ, վարչարարություն եւ այդ ոլորտները կարգավորող օրենքներ, Սահմանադրության փոփոխություններ, դատավարական օրենսգրքեր, ինչպես նաեւ քաղաքացիական, քրեական օրենսգրքեր, վարչական իրավախախտումների վերաբերյալ օրենսգիրք"
    },
    {
        "id": 9,
        "title": "9․ Տարածաշրջանային եւ եվրասիական ինտեգրման հարցերի մշտական հանձնաժողով՝",
        "text": "Եվրասիական տնտեսական միության եւ տարածաշրջանի մյուս երկրների հետ կապեր, Հայաստանի Հանրապետության եւ Եվրասիական տնտեսական միության անդամ մյուս պետությունների օրենսդրության ներդաշնակեցում, միասնականացում եւ այդ ոլորտները կարգավորող օրենքներ"
    },
    {
        "id": 10,
        "title": "10․ Տարածքային կառավարման, տեղական ինքնակառավարման, գյուղատնտեսության եւ շրջակա միջավայրի պահպանության հարցերի մշտական հանձնաժողով",
        "text": "տարածքային կառավարում, վարչատարածքային բաժանում, տեղական ինքնակառավարում, տարածքային զարգացում, համայնքային ծառայություն, տեղական հարկեր, տուրքեր եւ վճարներ, գյուղատնտեսություն, շրջակա միջավայրի պահպանություն "
    },
    {
        "id": 11,
        "title": "11․ Տնտեսական հարցերի մշտական հանձնաժողով",
        "text": "հարկեր, տուրքեր, վճարներ, արդյունաբերություն, քաղաքաշինություն, էներգետիկա, բնական պաշարներ, տրանսպորտ, կապ, հեռահաղորդակցություն, ինտերնետ (համացանց), արտադրական ենթակառուցվածքի այլ ճյուղեր, զբոսաշրջություն, առեւտուր եւ ծառայություններ, ձեռնարկատիրական գործունեություն, պետական գույքի կառավարում, սակագներ, ներդրումներ, տնտեսական մրցակցություն, հակամենաշնորհ եւ այդ ոլորտները կարգավորող օրենքներ"
    },
    {
        "id": 12,
        "title": "12․ Ֆինանսավարկային եւ բյուջետային հարցերի մշտական հանձնաժողով",
        "text": "հարկեր, տուրքեր, վճարներ, արդյունաբերություն, քաղաքաշինություն, էներգետիկա, բնական պաշարներ, տրանսպորտ, կապ, հեռահաղորդակցություն, ինտերնետ (համացանց), արտադրական ենթակառուցվածքի այլ ճյուղեր, զբոսաշրջություն, առեւտուր եւ ծառայություններ, ձեռնարկատիրական գործունեություն, պետական գույքի կառավարում, սակագներ, ներդրումներ, տնտեսական մրցակցություն, հակամենաշնորհ եւ այդ ոլորտները կարգավորող օրենքներ"
    }
])
  
  return (
    <div className='Committees'>
      <Header />
      <div className='CommitteesBody'>
        <div className='Committees_title'>
          <img src="./images/Frame3.png" alt="" />
          <h2>Մշտական հանձնաժողովները և նրանց գործունեության ոլորտները</h2>
        </div>
        <hr />
        <div className='Committees_main'>
          <h2>ՀՀ ԱԶԳԱՅԻՆ ԺՈՂՈՎԻ ՄՇՏԱԿԱՆ ՀԱՆՁՆԱԺՈՂՈՎՆԵՐԸ ԵՎ ՆՐԱՆՑ ԳՈՐԾՈՒՆԵՈՒԹՅԱՆ ՈԼՈՐՏՆԵՐԸ</h2>
          <div className='Committees_main_page'>
            {
              Committees.map(item => <div key={item.id}>
                <h3>{item.title}</h3>
                <p>{item.text}</p>
              </div>)
            }
          </div>
        </div>
      </div>
    </div>
  )
}
