import { Header } from '../../components/Header/Header'
import { useEffect, useState } from 'react';
import { useAppSelector, useAppDispatch } from '../../hooks/redux'
import { fetchDocCirculation } from "../../store/action/DocCirculationActions";
import './DocCirculation.scss';

export const DocCirculationPage = () => {

  // const { DocCirculation_1, DocCirculation_2, DocCirculation_3 } = useAppSelector(state => state.DocCirculation)
  // const dispatch = useAppDispatch()

  // useEffect(() => {
  //   dispatch(fetchDocCirculation())
  // }, [])

  const  [DocCirculation_1,setDocCirculation_1] = useState([
    {
        "id": 1,
        "text": " Սույն կարգով սահմանվում է Հայաստանի Հանրապետության Ազգային ժողովի (այսուհետ՝ ՀՀ Ազգային ժողով կամ Ազգային ժողով) նախագահի, նրա տեղակալների, աշխատակազմի ղեկավար-գլխավոր քարտուղարի և մշտական հանձնաժողովների կողմից քաղաքացիների ընդունելության կազմակերպման ու իրականացման կարգը։"
    },
    {
        "id": 2,
        "text": "Ազգային ժողովում քաղաքացիների ընդունելությունը կազմակերպում է Ազգային ժողովի աշխատակազմի քաղաքացիների ընդունելության և փաստաթղթաշրջանառության վարչության քաղաքացիների ընդունելության և նամակների բաժինը (այսուհետ՝ Քաղաքացիների ընդունելության և նամակների բաժին):"
    },
    {
        "id": 3,
        "text": "Քաղաքացիների մուտքն Ազգային ժողովի շենքի վարչական տարածք իրականացվում է Ազգային ժողովի նստավայրի տարածքում և շենքում գործող անվտանգության կանոներին համապատասխան (ՀՀ ԱԺ նախագահի ՆՈ-01-Լ որոշման համաձայն, մուտքը միայն անձը հաստատող փաստաթղթով)։"
    },
    {
        "id": 4,
        "text": "Քաղաքացիների ընդունելությունն իրականացվում է ընդունելությունների համար նախատեսված սրահում (հասցե՝ ք. Երևան, Մ․ Բաղրամյան պող., 19 շենք, ՀՀ Ազգային ժողովի ընդունարան)։"
    }
])
const [DocCirculation_2,setDocCirculation_2] = useState([
    {
        "id": 1,
        "text": " Քաղաքացիների ընդունելությունը կազմակերպվում է նախապես հերթագրման միջոցով։"
    },
    {
        "id": 2,
        "text": "Հերթագրման համար քաղաքացիները կարող են այցելել Ազգային ժողով կամ զանգահարել Ազգային ժողովի պաշտոնական ինտերնետային կայքում տեղադրված տեղեկատու հեռախոսահամարներով՝ 87-88, 010-50-60-50, 011-50-60-50 (կայքը՝ http://www.parliament.am) կամ ներկայացնել գրավոր դիմում (փոստով, առձեռն, Էլեկտրոնային հարցումների միասնական հարթակով՝ https://e-request.am/hy կամ էլ-փոստի միջոցով` letter@parliament.am)՝ ընդունելության անհրաժեշտության վերաբերյալ։ Դիմումում ներառվում է դիմումատուի անունը, ազգանունը, հայրանունը, բնակության հասցեն, ստորագրությունը, բջջային կամ քաղաքային հեռախոսահամարը և ամփոփ ներկայացվում է բարձրաձայնվող հարցը։"
    },
    {
        "id": 3,
        "text": "Ընդունելության համար հերթագրված քաղաքացիների տվյալները հավաքագրվում են Քաղաքացիների ընդունելության և նամակների բաժնում և ընդունելությունից 1 օր առաջ ուղարկվում են ընդունելությունն իրականացնող պաշտոնատար անձին՝ «Mulberry» էլեկտրոնային փաստաթղթաշրջանառության համակարգի միջոցով (այսուհետ՝ «Mulberry» համակարգ) կամ էլ-փոստի միջոցով։ Ընդունելության համար հերթագրված քաղաքացիների տվյալները գրանցվում են գրանցամատյաններում (գրանցամատյանները լինում են կնքված և համարակալված), որոնք էլ թղթային տվյալների հետ միասին հանձնվում են ՀՀ ԱԺ աշխատակազմի արխիվ՝ տարեկան ամփոփումից հետո (որպես կանոն արխիվ են հանձնվում դիմումները և մատյանները)։"
    },
    {
        "id": 4,
        "text": "Քաղաքացիների ընդունելության տվյալ ամսվա ցուցակում ընդգրկվում են յուրաքանչյուր ընդունելությունից առնվազն երկու աշխատանքային օր առաջ հերթագրված քաղաքացիները։ Նշված ժամկետից հետո հերթագրված քաղաքացիների հայտերը ներառվում են հաջորդ ամսվա ընդունելության ցուցակում, բացառությամբ հրատապ դեպքերի (դեպքի հրատապությունը որոշվում է ընդունելությունն իրականացնող պաշտոնատար անձի հետ քննարկման արդյունքում)։"
    },
    {
        "id": 5,
        "text": "Քաղաքացին չի ընդգրկվում ընդունելության ցուցակում, եթե.",
        "text_A": "վերջին երեք ամսվա ընթացքում քաղաքացին միևնույն հարցով մասնակցել է միևնույն պաշտոնատար անձի, կամ նրա կողմից լիազորված անձի ընդունելությանը և իր բարձրացրած հարցի վերաբերյալ ստացել է պարզաբանում։Այս դեպքում դիմումատուին Քաղաքացիների ընդունելության և նամակների բաժնի կողմից տրվում է պատճառաբանված գրավոր կամ բանավոր պատասխան ընդունելության ցուցակում չընդգրկվելու վերաբերյալ (կախված քաղաքացու՝ բանավոր կամ գրավոր դիմելու հանգամանքից)։",
        "text_B": "բարձրացված հարցը պահանջում է այնպիսի գործողություն, որը կարող է հանգեցնել արդարադատություն իրականացնող և/կամ իրավապահ մարմինների գործունեության միջամտությանը։"
    },
    {
        "id": 6,
        "text": "Ընդունելությունն իրականացնող պաշտոնատար անձանց հանձնարարությամբ նրանց կողմից կազմակերպված ընդունելությանը կարող են մասնակցել և/կամ իրականացնել նրանց խորհրդականները, օգնականները, փորձագետները:"
    },
    {
        "id": 7,
        "text": "Յուրաքանչյուր ընդունելության համար նախատեսվում է 2 (երկու) ժամ, ընդունելությանը կարող է մասնակցել առավելագույնը 8 (ութ) քաղաքացի: Ընդունելության ժամանակ մեկ քաղաքացու հարցի քննարկման համար նախատեսվում է 15 րոպե։ Քննարկման տևողությունը կարող է փոփոխվել ընդունելությունն իրականացնող պաշտոնատար անձի կամ նրա կողմից լիազորված անձի առաջարկով։"
    },
    {
        "id": 8,
        "text": "Ընդունելություն իրականացնող պաշտոնատար անձի կամ նրա կողմից լիազորված անձի բացակայության դեպքում ընդունելությունը տեղափոխվում է այլ աշխատանքային օր, ինչի մասին նախապես ծանուցվում է ընդունելությանը հերթագրված քաղաքացիներին: "
    },
    {
        "id": 9,
        "text": "Սույն Կարգը, ինչպես նաև Ազգային ժողովի նախագահի, նրա տեղակալների, աշխատակազմի ղեկավարի-գլխավոր քարտուղարի և մշտական հանձնաժողովների կողմից իրականացվող քաղաքացիների ընդունելության օրերի և ժամերի վերաբերյալ տեղեկատվությունը տեղադրվում է Ազգային ժողովի պաշտոնական ինտերնետային կայքում և Ֆեյսբուքյան պաշտոնական էջում, ինչպես նաև փակցվում է Ազգային ժողովի ընդունարանում (այդ թվում՝ թվային տարբերակով էլեկտրոնային մոնիտորի վրա, որը տեղադրված է ընդունարանում)՝ քաղաքացիների համար տեսանելի վայրում:"
    }
])
const [DocCirculation_3,setDocCirculation_3] = useState([
    {
        "id": 1,
        "text": "Սույն Կարգով սահմանված ՀՀ Ազգային ժողովի նախագահի, նրա տեղակալների, աշխատակազմի ղեկավար-գլխավոր քարտուղարի (ինչպես նաև նրանց խորհրդականների, օգնականների, փորձագետների) և մշտական հանձնաժողովների կողմից քաղաքացիների ընդունելության ժամանակ, անհրաժեշտության դեպքում, քաղաքացու կողմից ներկայացված գրավոր դիմումները գրանցվում են «Mulberry» համակարգում և ուղարկվում են ընդունելությունն իրականացրած պաշտոնատար անձին՝ համապատասխան ընթացքն ապահովելու համար։"
    },
    {
        "id": 2,
        "text": "Սույն Կարգով սահմանված քաղաքացիների ընդունելության վերաբերյալ հավաքագրված տվյալների հիման վրա՝ Քաղաքացիների ընդունելության և նամակների բաժինը քաղաքացիների դիմումների, բողոքների և առաջարկությունների հետ միաժամանակ վերլուծում և ամփոփում է կատարված աշխատանքների արդյունքները, կազմում է ամսական, կիսամյակային և տարեկան վիճակագրական հաշվետվություններ՝ Ազգային ժողովի աշխատակազմի ղեկավար-գլխավոր քարտուղարին ներկայացնելու համար: Ներկայացված տարեկան հաշվետվությունը տեղադրվում է Ազգային ժողովի պաշտոնական ինտերնետային կայքում և Ֆեյսբուքյան պաշտոնական էջում:"
    },
    {
        "id": 3,
        "text": "Պաշտոնատար անձանց կողմից քաղաքացիների ընդունելություն չի իրականացվում հունվար, հուլիս և օգոստոս ամիսներին՝ բացառությամբ սույն կարգով սահմանված հրատապ դեպքերի:"
    }
])

  return (
    <div className='DocCirculation'>
      <Header />
      <div className='DocCirculationBody'>
        <div className='DocCirculation_title'>
          <img src="./images/Frame1.png" alt="" />
          <h2>Քաղաքացիների ընդունելության և  փաստաթղթաշրջանառության կարգը</h2>
        </div>
        <hr />
        <div className='DocCirculation_main'>
          <h2>ԿԱՐԳ</h2>
          <div className='DocCirculation_main_page'>
            <h3>I.	Ընդհանուր դրույթներ</h3>
            {
              DocCirculation_1.map(item => <ul key={item.id}>
                <li>{item.text}</li>
              </ul>)
            }
            <h3>I.	Ընդհանուր դրույթներ</h3>
            {
              DocCirculation_2.map(item => <ul key={item.id}>
                <li>{item.text}
                  {item.text_A && <p>{item?.text_A}</p>}
                  {item.text_B && <p>{item?.text_B}</p>}
                </li>
              </ul>)
            }
            <h3>III.	Պաշտոնատար անձանց կողմից իրականացված ընդունելության ժամանակ քաղաքացու կողմից ներկայացված գրավոր դիմումների գրանցում  և հաշվետվողականության ապահովում</h3>
            {
              DocCirculation_3.map(item => <ul key={item.id}>
                <li>{item.text}</li>
              </ul>)
            }
          </div>
        </div>
      </div>
    </div>
  )
}

